import { TextContainer } from "../../components/TextContainer";
import { TextConfig } from "../../components/TextConfig";
import "./TestPage.css";

export const TestPage = () => {
  // const text =
  //   "Швидкість друку є важливою навичкою у сучасному світі, де більшість комунікацій та роботи відбувається через клавіатуру. Вміння швидко та безпомилково набирати текст значно підвищує продуктивність, дозволяючи зосередитися на змісті, а не на механіці процесу. Регулярна практика допомагає розвинути м’язову пам’ять, що з часом робить друк майже автоматичним. Інструменти, що вимірюють кількість слів за хвилину, є чудовим способом відстежувати прогрес і ставити нові цілі. Це не просто змагання, а інвестиція у власний професійний розвиток.";

  const text =
    "Вона повільно йшла по вулиці, освітленій лише ліхтарями. Повітря було наповнене ароматом дощу і свіжої землі. У її руках була стара, потерта книга, яку вона читала вже втретє. Кожна сторінка повертала її в інший світ, де проблеми здавалися дрібними, а час — нескінченним. Вона зупинилась біля вітрини антикварного магазину, де у світлі місяця блищала срібна брошка. У цей момент вона відчула легкий дотик до своєї руки. Повернувшись, вона побачила старого, який посміхався, ніби вони знали одне одного все життя. Він нічого не сказав, просто передав їй маленьку квітку і зник у темряві.";

  return (
    <div className="test-page">
      <TextConfig />
      <TextContainer targetText={text} />
      <div className="buttons-container">
        <button className="restart-test-button">
          <svg className="replay-icon" width={24} height={24}>
            <use href="./src/assets/icons.svg#replay-icon" />
          </svg>
        </button>
        <span className="timer">00:15</span>
      </div>
    </div>
  );
};
