import "./TestPage.css";

export const TextContainer = () => {
  const text =
    "Швидкість друку є важливою навичкою у сучасному світі, де більшість комунікацій та роботи відбувається через клавіатуру. Вміння швидко та безпомилково набирати текст значно підвищує продуктивність, дозволяючи зосередитися на змісті, а не на механіці процесу. Регулярна практика допомагає розвинути м’язову пам’ять, що з часом робить друк майже автоматичним. Інструменти, що вимірюють кількість слів за хвилину, є чудовим способом відстежувати прогрес і ставити нові цілі. Це не просто змагання, а інвестиція у власний професійний розвиток.";

  const chars = text.split("");

  return (
    <div className="text-container">
      {chars.map((char, index) => (
        <p key={index} className="text">
          {char}
        </p>
      ))}
    </div>
  );
};
